wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/ui2c_reg.h
#define UI2C_BRGEN_DSCNT_Pos          (10)                                           /*!< UI2C_T::BRGEN: DSCNT Position       */
#define UI2C_BRGEN_DSCNT_Msk          (0x1ful << UI2C_BRGEN_DSCNT_Pos)               /*!< UI2C_T::BRGEN: DSCNT Mask           */

#define UI2C_BRGEN_CLKDIV_Pos         (16)                                           /*!< UI2C_T::BRGEN: CLKDIV Position      */
#define UI2C_BRGEN_CLKDIV_Msk         (0x3fful << UI2C_BRGEN_CLKDIV_Pos)             /*!< UI2C_T::BRGEN: CLKDIV Mask          */

#define UI2C_BRGEN_NFCNT_Pos          (28)                                           /*!< UI2C_T::BRGEN: NFCNT Position       */
#define UI2C_BRGEN_NFCNT_Msk          (0xful << UI2C_BRGEN_NFCNT_Pos)                /*!< UI2C_T::BRGEN: NFCNT Mask           */

#define UI2C_LINECTL_LSB_Pos          (0)                                            /*!< UI2C_T::LINECTL: LSB Position       */
#define UI2C_LINECTL_LSB_Msk          (0x1ul << UI2C_LINECTL_LSB_Pos)                /*!< UI2C_T::LINECTL: LSB Mask           */

#define UI2C_LINECTL_DWIDTH_Pos       (8)                                            /*!< UI2C_T::LINECTL: DWIDTH Position    */
#define UI2C_LINECTL_DWIDTH_Msk       (0xful << UI2C_LINECTL_DWIDTH_Pos)             /*!< UI2C_T::LINECTL: DWIDTH Mask        */

#define UI2C_TXDAT_TXDAT_Pos          (0)                                            /*!< UI2C_T::TXDAT: TXDAT Position       */
#define UI2C_TXDAT_TXDAT_Msk          (0xfffful << UI2C_TXDAT_TXDAT_Pos)             /*!< UI2C_T::TXDAT: TXDAT Mask           */

#define UI2C_RXDAT_RXDAT_Pos          (0)                                            /*!< UI2C_T::RXDAT: RXDAT Position       */
#define UI2C_RXDAT_RXDAT_Msk          (0xfffful << UI2C_RXDAT_RXDAT_Pos)             /*!< UI2C_T::RXDAT: RXDAT Mask           */

#define UI2C_DEVADDR0_DEVADDR_Pos     (0)                                            /*!< UI2C_T::DEVADDR0: DEVADDR Position  */
#define UI2C_DEVADDR0_DEVADDR_Msk     (0x3fful << UI2C_DEVADDR0_DEVADDR_Pos)         /*!< UI2C_T::DEVADDR0: DEVADDR Mask      */

#define UI2C_DEVADDR1_DEVADDR_Pos     (0)                                            /*!< UI2C_T::DEVADDR1: DEVADDR Position  */
#define UI2C_DEVADDR1_DEVADDR_Msk     (0x3fful << UI2C_DEVADDR1_DEVADDR_Pos)         /*!< UI2C_T::DEVADDR1: DEVADDR Mask      */

#define UI2C_ADDRMSK0_ADDRMSK_Pos     (0)                                            /*!< UI2C_T::ADDRMSK0: ADDRMSK Position  */
#define UI2C_ADDRMSK0_ADDRMSK_Msk     (0x3fful << UI2C_ADDRMSK0_ADDRMSK_Pos)         /*!< UI2C_T::ADDRMSK0: ADDRMSK Mask      */

#define UI2C_ADDRMSK1_ADDRMSK_Pos     (0)                                            /*!< UI2C_T::ADDRMSK1: ADDRMSK Position  */
#define UI2C_ADDRMSK1_ADDRMSK_Msk     (0x3fful << UI2C_ADDRMSK1_ADDRMSK_Pos)         /*!< UI2C_T::ADDRMSK1: ADDRMSK Mask      */

#define UI2C_WKCTL_WKEN_Pos           (0)                                            /*!< UI2C_T::WKCTL: WKEN Position        */
#define UI2C_WKCTL_WKEN_Msk           (0x1ul << UI2C_WKCTL_WKEN_Pos)                 /*!< UI2C_T::WKCTL: WKEN Mask            */

#define UI2C_WKCTL_WKADDREN_Pos       (1)                                            /*!< UI2C_T::WKCTL: WKADDREN Position    */
#define UI2C_WKCTL_WKADDREN_Msk       (0x1ul << UI2C_WKCTL_WKADDREN_Pos)             /*!< UI2C_T::WKCTL: WKADDREN Mask        */

#define UI2C_WKSTS_WKF_Pos            (0)                                            /*!< UI2C_T::WKSTS: WKF Position         */
#define UI2C_WKSTS_WKF_Msk            (0x1ul << UI2C_WKSTS_WKF_Pos)                  /*!< UI2C_T::WKSTS: WKF Mask             */

#define UI2C_PROTCTL_GCFUNC_Pos       (0)                                            /*!< UI2C_T::PROTCTL: GCFUNC Position    */
#define UI2C_PROTCTL_GCFUNC_Msk       (0x1ul << UI2C_PROTCTL_GCFUNC_Pos)             /*!< UI2C_T::PROTCTL: GCFUNC Mask        */

#define UI2C_PROTCTL_AA_Pos           (1)                                            /*!< UI2C_T::PROTCTL: AA Position        */
#define UI2C_PROTCTL_AA_Msk           (0x1ul << UI2C_PROTCTL_AA_Pos)                 /*!< UI2C_T::PROTCTL: AA Mask            */

#define UI2C_PROTCTL_STO_Pos          (2)                                            /*!< UI2C_T::PROTCTL: STO Position       */
#define UI2C_PROTCTL_STO_Msk          (0x1ul << UI2C_PROTCTL_STO_Pos)                /*!< UI2C_T::PROTCTL: STO Mask           */

#define UI2C_PROTCTL_STA_Pos          (3)                                            /*!< UI2C_T::PROTCTL: STA Position       */
#define UI2C_PROTCTL_STA_Msk          (0x1ul << UI2C_PROTCTL_STA_Pos)                /*!< UI2C_T::PROTCTL: STA Mask           */

#define UI2C_PROTCTL_ADDR10EN_Pos     (4)                                            /*!< UI2C_T::PROTCTL: ADDR10EN Position  */
#define UI2C_PROTCTL_ADDR10EN_Msk     (0x1ul << UI2C_PROTCTL_ADDR10EN_Pos)           /*!< UI2C_T::PROTCTL: ADDR10EN Mask      */

#define UI2C_PROTCTL_PTRG_Pos         (5)                                            /*!< UI2C_T::PROTCTL: PTRG Position      */
#define UI2C_PROTCTL_PTRG_Msk         (0x1ul << UI2C_PROTCTL_PTRG_Pos)               /*!< UI2C_T::PROTCTL: PTRG Mask          */

#define UI2C_PROTCTL_SCLOUTEN_Pos     (8)                                            /*!< UI2C_T::PROTCTL: SCLOUTEN Position  */
#define UI2C_PROTCTL_SCLOUTEN_Msk     (0x1ul << UI2C_PROTCTL_SCLOUTEN_Pos)           /*!< UI2C_T::PROTCTL: SCLOUTEN Mask      */

#define UI2C_PROTCTL_MONEN_Pos        (9)                                            /*!< UI2C_T::PROTCTL: MONEN Position     */
#define UI2C_PROTCTL_MONEN_Msk        (0x1ul << UI2C_PROTCTL_MONEN_Pos)              /*!< UI2C_T::PROTCTL: MONEN Mask         */

#define UI2C_PROTCTL_TOCNT_Pos        (16)                                           /*!< UI2C_T::PROTCTL: TOCNT Position     */
#define UI2C_PROTCTL_TOCNT_Msk        (0x3fful << UI2C_PROTCTL_TOCNT_Pos)            /*!< UI2C_T::PROTCTL: TOCNT Mask         */

#define UI2C_PROTCTL_PROTEN_Pos       (31)                                           /*!< UI2C_T::PROTCTL: PROTEN Position    */
#define UI2C_PROTCTL_PROTEN_Msk       (0x1ul << UI2C_PROTCTL_PROTEN_Pos)             /*!< UI2C_T::PROTCTL: PROTEN Mask        */

#define UI2C_PROTIEN_TOIEN_Pos        (0)                                            /*!< UI2C_T::PROTIEN: TOIEN Position     */
#define UI2C_PROTIEN_TOIEN_Msk        (0x1ul << UI2C_PROTIEN_TOIEN_Pos)              /*!< UI2C_T::PROTIEN: TOIEN Mask         */

